; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite4 - satellite
	instrument11 - instrument
	instrument12 - instrument
	image2 - mode
	spectrograph0 - mode
	thermograph1 - mode
	GroundStation0 - direction
	GroundStation1 - direction
	Star3 - direction
	GroundStation2 - direction
	Star4 - direction
	Phenomenon5 - direction
	Star6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Planet16 - direction
	Phenomenon17 - direction
	Star18 - direction
	Phenomenon19 - direction
	Star20 - direction
	Phenomenon21 - direction
	Planet22 - direction
	Star23 - direction
	Star24 - direction
	Planet25 - direction
	Star26 - direction
	Planet27 - direction
	Star28 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image2)
	(calibration_target instrument0 Star3)
	(supports instrument1 image2)
	(supports instrument1 thermograph1)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation1)
	(supports instrument2 thermograph1)
	(calibration_target instrument2 Star3)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star15)
	(supports instrument3 spectrograph0)
	(supports instrument3 image2)
	(supports instrument3 thermograph1)
	(calibration_target instrument3 GroundStation2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star3)
	(supports instrument5 image2)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet27)
	(supports instrument6 image2)
	(calibration_target instrument6 Star3)
	(supports instrument7 image2)
	(supports instrument7 thermograph1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 GroundStation1)
	(supports instrument8 image2)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon19)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star3)
	(supports instrument10 image2)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 GroundStation2)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star14)
	(supports instrument11 image2)
	(calibration_target instrument11 GroundStation2)
	(supports instrument12 thermograph1)
	(supports instrument12 spectrograph0)
	(supports instrument12 image2)
	(calibration_target instrument12 Star4)
	(on_board instrument11 satellite4)
	(on_board instrument12 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon13)
)
(:goal (and
	(pointing satellite0 Phenomenon21)
	(pointing satellite2 Phenomenon17)
	(have_image Phenomenon5 spectrograph0)
	(have_image Star6 spectrograph0)
	(have_image Star7 spectrograph0)
	(have_image Phenomenon8 image2)
	(have_image Phenomenon9 spectrograph0)
	(have_image Planet10 thermograph1)
	(have_image Phenomenon12 image2)
	(have_image Phenomenon13 spectrograph0)
	(have_image Star14 thermograph1)
	(have_image Star15 image2)
	(have_image Planet16 image2)
	(have_image Phenomenon17 thermograph1)
	(have_image Star18 thermograph1)
	(have_image Phenomenon19 spectrograph0)
	(have_image Star20 thermograph1)
	(have_image Phenomenon21 image2)
	(have_image Planet22 thermograph1)
	(have_image Star23 image2)
	(have_image Star24 image2)
	(have_image Planet25 image2)
	(have_image Star26 image2)
	(have_image Planet27 image2)
))

)

; plan
1. (switch_on instrument11 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument11)
   goals met: 0 of 24
2. (switch_on instrument7 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument7)
   goals met: 0 of 24
3. (turn_to satellite4 groundstation2 phenomenon13)
   deleted: (pointing satellite4 phenomenon13)
   added: (pointing satellite4 groundstation2)
   goals met: 0 of 24
4. (calibrate satellite4 instrument11 groundstation2)
   added: (calibrated instrument11)
   goals met: 0 of 24
5. (turn_to satellite4 phenomenon12 groundstation2)
   deleted: (pointing satellite4 groundstation2)
   added: (pointing satellite4 phenomenon12)
   goals met: 0 of 24
6. (take_image satellite4 phenomenon12 instrument11 image2)
   added: (have_image phenomenon12 image2)
   goals met: 1 of 24
7. (turn_to satellite4 phenomenon21 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon21)
   goals met: 1 of 24
8. (take_image satellite4 phenomenon21 instrument11 image2)
   added: (have_image phenomenon21 image2)
   goals met: 2 of 24
9. (turn_to satellite4 phenomenon8 phenomenon21)
   deleted: (pointing satellite4 phenomenon21)
   added: (pointing satellite4 phenomenon8)
   goals met: 2 of 24
10. (take_image satellite4 phenomenon8 instrument11 image2)
   added: (have_image phenomenon8 image2)
   goals met: 3 of 24
11. (turn_to satellite4 planet16 phenomenon8)
   deleted: (pointing satellite4 phenomenon8)
   added: (pointing satellite4 planet16)
   goals met: 3 of 24
12. (take_image satellite4 planet16 instrument11 image2)
   added: (have_image planet16 image2)
   goals met: 4 of 24
13. (turn_to satellite4 planet25 planet16)
   deleted: (pointing satellite4 planet16)
   added: (pointing satellite4 planet25)
   goals met: 4 of 24
14. (take_image satellite4 planet25 instrument11 image2)
   added: (have_image planet25 image2)
   goals met: 5 of 24
15. (turn_to satellite4 planet27 planet25)
   deleted: (pointing satellite4 planet25)
   added: (pointing satellite4 planet27)
   goals met: 5 of 24
16. (take_image satellite4 planet27 instrument11 image2)
   added: (have_image planet27 image2)
   goals met: 6 of 24
17. (turn_to satellite4 star15 planet27)
   deleted: (pointing satellite4 planet27)
   added: (pointing satellite4 star15)
   goals met: 6 of 24
18. (take_image satellite4 star15 instrument11 image2)
   added: (have_image star15 image2)
   goals met: 7 of 24
19. (turn_to satellite4 star23 star15)
   deleted: (pointing satellite4 star15)
   added: (pointing satellite4 star23)
   goals met: 7 of 24
20. (take_image satellite4 star23 instrument11 image2)
   added: (have_image star23 image2)
   goals met: 8 of 24
21. (turn_to satellite4 star24 star23)
   deleted: (pointing satellite4 star23)
   added: (pointing satellite4 star24)
   goals met: 8 of 24
22. (take_image satellite4 star24 instrument11 image2)
   added: (have_image star24 image2)
   goals met: 9 of 24
23. (turn_to satellite4 star26 star24)
   deleted: (pointing satellite4 star24)
   added: (pointing satellite4 star26)
   goals met: 9 of 24
24. (take_image satellite4 star26 instrument11 image2)
   added: (have_image star26 image2)
   goals met: 10 of 24
25. (turn_to satellite2 groundstation1 phenomenon19)
   deleted: (pointing satellite2 phenomenon19)
   added: (pointing satellite2 groundstation1)
   goals met: 10 of 24
26. (calibrate satellite2 instrument7 groundstation1)
   added: (calibrated instrument7)
   goals met: 10 of 24
27. (turn_to satellite2 phenomenon13 groundstation1)
   deleted: (pointing satellite2 groundstation1)
   added: (pointing satellite2 phenomenon13)
   goals met: 10 of 24
28. (take_image satellite2 phenomenon13 instrument7 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 11 of 24
29. (turn_to satellite2 phenomenon17 phenomenon13)
   deleted: (pointing satellite2 phenomenon13)
   added: (pointing satellite2 phenomenon17)
   goals met: 12 of 24
30. (take_image satellite2 phenomenon17 instrument7 thermograph1)
   added: (have_image phenomenon17 thermograph1)
   goals met: 13 of 24
31. (turn_to satellite0 phenomenon21 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 phenomenon21)
   goals met: 14 of 24
32. (turn_to satellite2 phenomenon19 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon19)
   goals met: 13 of 24
33. (take_image satellite2 phenomenon19 instrument7 spectrograph0)
   added: (have_image phenomenon19 spectrograph0)
   goals met: 14 of 24
34. (turn_to satellite2 phenomenon17 phenomenon19)
   deleted: (pointing satellite2 phenomenon19)
   added: (pointing satellite2 phenomenon17)
   goals met: 15 of 24
35. (turn_to satellite2 phenomenon5 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon5)
   goals met: 14 of 24
36. (take_image satellite2 phenomenon5 instrument7 spectrograph0)
   added: (have_image phenomenon5 spectrograph0)
   goals met: 15 of 24
37. (turn_to satellite2 phenomenon17 phenomenon5)
   deleted: (pointing satellite2 phenomenon5)
   added: (pointing satellite2 phenomenon17)
   goals met: 16 of 24
38. (turn_to satellite2 phenomenon9 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 phenomenon9)
   goals met: 15 of 24
39. (take_image satellite2 phenomenon9 instrument7 spectrograph0)
   added: (have_image phenomenon9 spectrograph0)
   goals met: 16 of 24
40. (turn_to satellite2 phenomenon17 phenomenon9)
   deleted: (pointing satellite2 phenomenon9)
   added: (pointing satellite2 phenomenon17)
   goals met: 17 of 24
41. (turn_to satellite2 planet10 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 planet10)
   goals met: 16 of 24
42. (take_image satellite2 planet10 instrument7 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 17 of 24
43. (turn_to satellite2 phenomenon17 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon17)
   goals met: 18 of 24
44. (turn_to satellite2 planet22 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 planet22)
   goals met: 17 of 24
45. (take_image satellite2 planet22 instrument7 thermograph1)
   added: (have_image planet22 thermograph1)
   goals met: 18 of 24
46. (turn_to satellite2 phenomenon17 planet22)
   deleted: (pointing satellite2 planet22)
   added: (pointing satellite2 phenomenon17)
   goals met: 19 of 24
47. (turn_to satellite2 star14 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 star14)
   goals met: 18 of 24
48. (take_image satellite2 star14 instrument7 thermograph1)
   added: (have_image star14 thermograph1)
   goals met: 19 of 24
49. (turn_to satellite2 phenomenon17 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 phenomenon17)
   goals met: 20 of 24
50. (turn_to satellite2 star18 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 star18)
   goals met: 19 of 24
51. (take_image satellite2 star18 instrument7 thermograph1)
   added: (have_image star18 thermograph1)
   goals met: 20 of 24
52. (turn_to satellite2 phenomenon17 star18)
   deleted: (pointing satellite2 star18)
   added: (pointing satellite2 phenomenon17)
   goals met: 21 of 24
53. (turn_to satellite2 star20 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 star20)
   goals met: 20 of 24
54. (take_image satellite2 star20 instrument7 thermograph1)
   added: (have_image star20 thermograph1)
   goals met: 21 of 24
55. (turn_to satellite2 phenomenon17 star20)
   deleted: (pointing satellite2 star20)
   added: (pointing satellite2 phenomenon17)
   goals met: 22 of 24
56. (turn_to satellite2 star6 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 star6)
   goals met: 21 of 24
57. (take_image satellite2 star6 instrument7 spectrograph0)
   added: (have_image star6 spectrograph0)
   goals met: 22 of 24
58. (turn_to satellite2 phenomenon17 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 phenomenon17)
   goals met: 23 of 24
59. (turn_to satellite2 star7 phenomenon17)
   deleted: (pointing satellite2 phenomenon17)
   added: (pointing satellite2 star7)
   goals met: 22 of 24
60. (take_image satellite2 star7 instrument7 spectrograph0)
   added: (have_image star7 spectrograph0)
   goals met: 23 of 24
61. (turn_to satellite2 phenomenon17 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon17)
   goals met: 24 of 24
